In [564]:
import numpy as np
import pandas as pd
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [565]:
df = pd.read_csv('titanic.csv', usecols=['Age', 'Pclass', 'SibSp', 'Parch', 'Survived'])
df.head()

   Survived  Pclass   Age  SibSp  Parch
0         0       3  22.0      1      0
1         1       1  38.0      1      0
2         1       3  26.0      0      0
3         1       1  35.0      1      0
4         0       3  35.0      0      0

In [566]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
SibSp         0
Parch         0
dtype: int64

In [567]:
df.dropna(inplace=True)

In [568]:
df.shape

(714, 5)

In [569]:
y = df.iloc[:, 0]
X = df.iloc[:, 1:5]

In [570]:
model = LogisticRegression()
np.mean(cross_val_score(model, X, y, scoring='accuracy', cv=20))

0.6933333333333332

#### Using Feature Construction Method

Combining Parch and SibSp to familysize and adding 1 since the passenger is also included

In [573]:
df['FamilySize'] = df['Parch'] + df['SibSp'] + 1

In [574]:
def func(num):
    # passenger is along
    if num == 1:
        return 0
    elif num >= 2 and num <= 4:
    # passenger is travelling with small family
        return 1
    else:
    # passenger is travelling with big family
        return 2

In [575]:
df['FamilyType'] = df['FamilySize'].apply(func)

In [576]:
df

     Survived  Pclass   Age  SibSp  Parch  FamilySize  FamilyType
0           0       3  22.0      1      0           2           1
1           1       1  38.0      1      0           2           1
2           1       3  26.0      0      0           1           0
3           1       1  35.0      1      0           2           1
4           0       3  35.0      0      0           1           0
..        ...     ...   ...    ...    ...         ...         ...
885         0       3  39.0      0      5           6           2
886         0       2  27.0      0      0           1           0
887         1       1  19.0      0      0           1           0
889         1       1  26.0      0      0           1           0
890         0       3  32.0      0      0           1           0

[714 rows x 7 columns]

Now, since FamilyType is our representation of SibSp, Parch and FamilySize, we do not really need to have these columns.

In [578]:
df.drop(columns=['SibSp', 'Parch', 'FamilySize'], axis=1, inplace=True)

In [579]:
new_X = df.iloc[:, 1:4]
new_y = df.iloc[:, 0]

In [580]:
np.mean(cross_val_score(LogisticRegression(), new_X, new_y, scoring='accuracy', cv=20))

0.7003174603174602

#### Feature Splitting

In [582]:
data = pd.read_csv('titanic.csv', usecols=['Name', 'Survived'])

In [583]:
data

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [584]:
data['Title'] = data['Name'].str.split(',', expand=True)[1].str.split('.', expand=True)[0] 
# setting expand==True will return all the DataFrames, by default it is set to false which only returns a series

In [585]:
data = data[['Title', 'Name', 'Survived']]

In [673]:
data

,Title,Name,Survived,Is_married
0,Mr,"Braund, Mr. Owen Harris",0,0
1,Mrs,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0
2,Miss,"Heikkinen, Miss. Laina",1,0
3,Mrs,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,0
4,Mr,"Allen, Mr. William Henry",0,0
...,...,...,...,...
886,Rev,"Montvila, Rev. Juozas",0,0
887,Miss,"Graham, Miss. Margaret Edith",1,0
888,Miss,"Johnston, Miss. Catherine Helen ""Carrie""",0,0
889,Mr,"Behr, Mr. Karl Howell",1,0
890,Mr,"Dooley, Mr. Patrick",0,0

In [675]:
data = data.copy()
data['Is_married'] = np.where(
    data['Title'] == 'Mrs',
    1,
    0
)

C:\Users\12368\AppData\Local\Temp\ipykernel_21436\2362194888.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['Is_married'].loc[data['Title'] == 'Mrs'] = 1
C:\Users\12368\AppData\Local\Temp\ipykernel_21436\2362194888.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Is_married'].loc[data['Title'] == 'Mrs'] = 1

In [677]:
data.nunique()

Title          17
Name          891
Survived        2
Is_married      1
dtype: int64

In [679]:
data

,Title,Name,Survived,Is_married
0,Mr,"Braund, Mr. Owen Harris",0,0
1,Mrs,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,0
2,Miss,"Heikkinen, Miss. Laina",1,0
3,Mrs,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,0
4,Mr,"Allen, Mr. William Henry",0,0
...,...,...,...,...
886,Rev,"Montvila, Rev. Juozas",0,0
887,Miss,"Graham, Miss. Margaret Edith",1,0
888,Miss,"Johnston, Miss. Catherine Helen ""Carrie""",0,0
889,Mr,"Behr, Mr. Karl Howell",1,0
890,Mr,"Dooley, Mr. Patrick",0,0

In [655]:
data['Title'].nunique

array([' Mr', ' Mrs', ' Miss', ' Master', ' Don', ' Rev', ' Dr', ' Mme',
       ' Ms', ' Major', ' Lady', ' Sir', ' Mlle', ' Col', ' Capt',
       ' the Countess', ' Jonkheer'], dtype=object)